uFVM/tutorials/compressible/bump/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }

    T
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }
}

SIMPLE
{
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;
    
    pRefCell            0;
    pRefValue           0;

    rhoMax              1.3;
    rhoMin              0.9;

    pMax                150000;
    pMin                0;

    residualControl
    {
        p               0.0001;
        U               0.0001;
        T               0.0001;
    }   
}

relaxationFactors 
{ 
    fields 
    { 
        p               0.1; 
    } 
    equations 
    { 
        U               0.3;
        T               0.2;
    } 
}


// ************************************************************************* //
